hacking/20230418174334-hacking_python_eval.org
:PROPERTIES:
:ID:       e1e99ad8-8982-4d5d-9e37-42d083188d24
:END:
#+TITLE: Hacking Python Eval
#+SETUPFILE: /home/unseen/Documents/Notes/org/roam/org-setup.org

#+CREATED: [2023-04-18 Tue 17:43]
#+LAST_MODIFIED: [2023-04-18 Tue 17:49]

* Hacking Python's eval
Never Ever use eval in production code where it will run user input.
Users could input a payload and run nasty python code.


** How eval works
Eval can be used to dynamically evaluate python expressions from a string. it can also take bytecode or even compiled code based input.
When you pass a string it compiles to bytecode then compiles it as a python expression.
Pass a bytecode object and itwill just run the object.


Note that the ~import~ function can not be used in a eval, instead use the builtin ~__import__~.
