hacking/20230418174334-hacking_python_eval.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-12 Wed 22:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Hacking Python Eval</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/org.css" />
</head>
<body>
<div id="preamble" class="status">
<nav class="navbar">
  <div class="navbar-mode-line">
    <a href="/" class="navbar-circle">◉</a>
    <a href="/programming" class="navbar-filename">programming</a>
    <a href="/hacking" class="navbar-filename">hacking</a>
    <a href="/Tutorial" class="navbar-filename">Tutorials</a>
    <a href="/posts.html" class="navbar-filename">All Posts</a>
  </div>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">Hacking Python Eval</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org64beebc">Hacking Python's eval</a>
<ul>
<li><a href="#org616bc20">How eval works</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org64beebc" class="outline-2">
<h2 id="org64beebc">Hacking Python's eval</h2>
<div class="outline-text-2" id="text-org64beebc">
<p>
Never Ever use eval in production code where it will run user input.
Users could input a payload and run nasty python code.
</p>
</div>


<div id="outline-container-org616bc20" class="outline-3">
<h3 id="org616bc20">How eval works</h3>
<div class="outline-text-3" id="text-org616bc20">
<p>
Eval can be used to dynamically evaluate python expressions from a string. it can also take bytecode or even compiled code based input.
When you pass a string it compiles to bytecode then compiles it as a python expression.
Pass a bytecode object and itwill just run the object.
</p>


<p>
Note that the <code>import</code> function can not be used in a eval, instead use the builtin <code>__import__</code>.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author:  (<a href="mailto:unseen@flake">unseen@flake</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.5.5)</p>
<p class="validation"></p>
</div>
</body>
</html>
